In [13]:
import pandas as pd 
import numpy as np

# Series object

In [2]:
pd.Series(5)

0    5
dtype: int64

create from list or array

In [6]:
data = pd.Series([54,65,98,32])
data

0    54
1    65
2    98
3    32
dtype: int64

Convert it to Numpy array

In [5]:
data.values

array([54, 65, 98, 32], dtype=int64)

In [7]:
data[2]

98

 Custom indexing

In [8]:
 data = pd.Series([54,65,98,32] , index=['first','second','third','forth'])
data

first     54
second    65
third     98
forth     32
dtype: int64

In [9]:
data['second']

65

In [10]:
data[1]

65

A Series From Python Dictionary

In [16]:
population_dict={ 'California':12356987,
                 'Taxes':56987456,
                 'New_York':5426897,
                 'Florida':45987632 }
area_dict={ 'California':500,
                 'Taxes':600,
                 'New_York':100,
                 'Florida':110 }
population_dict

{'California': 12356987,
 'Taxes': 56987456,
 'New_York': 5426897,
 'Florida': 45987632}

In [11]:
population_series=pd.Series(population_dict)
population_series

California    12356987
Taxes         56987456
New_York       5426897
Florida       45987632
dtype: int64

Slicing in Series

In [9]:
population_series['Taxes']

56987456

In [10]:
population_series['Taxes':'Florida']  # includeing start ,includeing end

Taxes       56987456
New_York     5426897
Florida     45987632
dtype: int64

In [12]:
population_series[1:3]  # includeing start ,execludeing end

Taxes       56987456
New_York     5426897
dtype: int64

# DataFrame

Create Dataframe from Series

In [17]:
pd.DataFrame({'population':population_series,
                'area':area_dict})

            population  area
California    12356987   500
Taxes         56987456   600
New_York       5426897   100
Florida       45987632   110

Create DataFrame from dictionaries

In [24]:
data=pd.DataFrame({'population':[12356987,56987456,5426897,45987632],
             'area':[500,600,100,110]}, index=['California','Taxes','New_York','Florida'])
data

            population  area
California    12356987   500
Taxes         56987456   600
New_York       5426897   100
Florida       45987632   110

Get the index labels

In [25]:
data.index

Index(['California', 'Taxes', 'New_York', 'Florida'], dtype='object')

Get the columns name

In [26]:
data.columns

Index(['population', 'area'], dtype='object')

Get specific column

In [29]:
data['area']

California    500
Taxes         600
New_York      100
Florida       110
Name: area, dtype: int64

In [30]:
type(data['area'])

pandas.core.series.Series

In [31]:
data['area']['Taxes']

600

Create DataFrame from single Series object

In [33]:
pd.DataFrame(population_series, columns=['Population'])

            Population
California    12356987
Taxes         56987456
New_York       5426897
Florida       45987632

In [34]:
pd.DataFrame({'Population':population_series})

            Population
California    12356987
Taxes         56987456
New_York       5426897
Florida       45987632

In [36]:
data=[{'A':i,'B':2*i} for i in range(10)]
data

[{'A': 0, 'B': 0},
 {'A': 1, 'B': 2},
 {'A': 2, 'B': 4},
 {'A': 3, 'B': 6},
 {'A': 4, 'B': 8},
 {'A': 5, 'B': 10},
 {'A': 6, 'B': 12},
 {'A': 7, 'B': 14},
 {'A': 8, 'B': 16},
 {'A': 9, 'B': 18}]

In [37]:
pd.DataFrame(data)

   A   B
0  0   0
1  1   2
2  2   4
3  3   6
4  4   8
5  5  10
6  6  12
7  7  14
8  8  16
9  9  18

when some keys are missing

In [38]:
pd.DataFrame([{'a':1,'b':2},{'b':5,'c':10}])

     a  b     c
0  1.0  2   NaN
1  NaN  5  10.0

In [40]:
arr=np.random.randint(1,20,30).reshape(10,3)
arr

array([[ 7,  1, 13],
       [ 8,  5,  1],
       [14,  3, 18],
       [ 3,  2, 10],
       [ 7, 10,  7],
       [16,  2, 17],
       [10, 16, 11],
       [ 9,  5,  8],
       [15,  9, 16],
       [12,  1, 17]])

In [42]:
pd.DataFrame(arr , columns=['age','length','weight'])

   age  length  weight
0    7       1      13
1    8       5       1
2   14       3      18
3    3       2      10
4    7      10       7
5   16       2      17
6   10      16      11
7    9       5       8
8   15       9      16
9   12       1      17

# Indexing and Selection

Read and show the first 5 rows from

In [43]:
df=pd.read_csv('ramen-ratings.csv')

In [44]:
df

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
0,2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
2,2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN
3,2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,NaN
4,2576,Ching's Secret,Singapore Curry,Pack,India,3.75,NaN
...,...,...,...,...,...,...,...
2575,5,Vifon,"Hu Tiu Nam Vang [""Phnom Penh"" style] Asian Sty...",Bowl,Vietnam,3.5,NaN
2576,4,Wai Wai,Oriental Style Instant Noodles,Pack,Thailand,1,NaN
2577,3,Wai Wai,Tom Yum Shrimp,Pack,Thailand,2,NaN
2578,2,Wai Wai,Tom Yum Chili Flavor,Pack,Thailand,2,NaN
2579,1,Westbrae,Miso Ramen,Pack,USA,0.5,NaN

In [45]:
df.head() # default value 5 values can change it like df.head(10) will get first 10

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
0,2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
2,2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN
3,2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,NaN
4,2576,Ching's Secret,Singapore Curry,Pack,India,3.75,NaN

Select the country Column from the data

In [46]:
df.Country

0          Japan
1         Taiwan
2            USA
3         Taiwan
4          India
          ...
2575     Vietnam
2576    Thailand
2577    Thailand
2578    Thailand
2579         USA
Name: Country, Length: 2580, dtype: object

In [47]:
df['Country']

0          Japan
1         Taiwan
2            USA
3         Taiwan
4          India
          ...
2575     Vietnam
2576    Thailand
2577    Thailand
2578    Thailand
2579         USA
Name: Country, Length: 2580, dtype: object

In [48]:
df['Top Ten']

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
       ...
2575    NaN
2576    NaN
2577    NaN
2578    NaN
2579    NaN
Name: Top Ten, Length: 2580, dtype: object

In [50]:
#df.Top Ten  --------> gives error

# index based selection

In [53]:
df.head(10)

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
0,2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
2,2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN
3,2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,NaN
4,2576,Ching's Secret,Singapore Curry,Pack,India,3.75,NaN
5,2575,Samyang Foods,Kimchi song Song Ramen,Pack,South Korea,4.75,NaN
6,2574,Acecook,Spice Deli Tantan Men With Cilantro,Cup,Japan,4,NaN
7,2573,Ikeda Shoku,Nabeyaki Kitsune Udon,Tray,Japan,3.75,NaN
8,2572,Ripe'n'Dry,Hokkaido Soy Sauce Ramen,Pack,Japan,0.25,NaN
9,2571,KOKA,The Original Spicy Stir-Fried Noodles,Pack,Singapore,2.5,NaN

Select the first row of data

In [51]:
df.iloc[0,:] # first row , all columns

Review #                         2580
Brand                       New Touch
Variety     T's Restaurant Tantanmen
Style                             Cup
Country                         Japan
Stars                            3.75
Top Ten                           NaN
Name: 0, dtype: object

Select the first column

In [54]:
df.iloc[:,0] # first column for all rows

0       2580
1       2579
2       2578
3       2577
4       2576
        ...
2575       5
2576       4
2577       3
2578       2
2579       1
Name: Review #, Length: 2580, dtype: int64

Select the first 3 rows

In [55]:
df.iloc[:3,:]

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
0,2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
2,2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN

Select the last row

In [60]:
df.iloc[:,-1]

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
       ...
2575    NaN
2576    NaN
2577    NaN
2578    NaN
2579    NaN
Name: Top Ten, Length: 2580, dtype: object

In [61]:
type(df.iloc[:,-1])

pandas.core.series.Series

Fancy indexing

In [57]:
df.iloc[[1,2,5,50,2000]]

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
2,2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN
5,2575,Samyang Foods,Kimchi song Song Ramen,Pack,South Korea,4.75,NaN
50,2530,Ottogi,Ppushu Ppushu Noodle Snack Honey Butter,Pack,South Korea,2,NaN
2000,580,Baijia,Hot & Sour Casserole Stewed Rice Noodle,Pack,China,0,NaN

Select the last 10 rows

In [59]:
df.iloc[-10:,:]

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
2570,10,Smack,Vegetable Beef,Pack,USA,1.5,NaN
2571,9,Sutah,Cup Noodle,Cup,South Korea,2,NaN
2572,8,Tung-I,Chinese Beef Instant Rice Noodle,Pack,Taiwan,3,NaN
2573,7,Ve Wong,Mushroom Pork,Pack,Vietnam,1,NaN
2574,6,Vifon,Nam Vang,Pack,Vietnam,2.5,NaN
2575,5,Vifon,"Hu Tiu Nam Vang [""Phnom Penh"" style] Asian Sty...",Bowl,Vietnam,3.5,NaN
2576,4,Wai Wai,Oriental Style Instant Noodles,Pack,Thailand,1,NaN
2577,3,Wai Wai,Tom Yum Shrimp,Pack,Thailand,2,NaN
2578,2,Wai Wai,Tom Yum Chili Flavor,Pack,Thailand,2,NaN
2579,1,Westbrae,Miso Ramen,Pack,USA,0.5,NaN

## Label based selection

In [62]:
df.head()

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
0,2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
2,2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN
3,2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,NaN
4,2576,Ching's Secret,Singapore Curry,Pack,India,3.75,NaN

Select Brand , Style and Stars columns

In [63]:
df.loc[:,['Brand','Style','Stars']]

               Brand Style Stars
0          New Touch   Cup  3.75
1           Just Way  Pack     1
2             Nissin   Cup  2.25
3            Wei Lih  Pack  2.75
4     Ching's Secret  Pack  3.75
...              ...   ...   ...
2575           Vifon  Bowl   3.5
2576         Wai Wai  Pack     1
2577         Wai Wai  Pack     2
2578         Wai Wai  Pack     2
2579        Westbrae  Pack   0.5

[2580 rows x 3 columns]

The differance between iloc and loc

In [64]:
df.iloc[1:4] # give me the row 1,2,3 execluding 4

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
2,2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN
3,2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,NaN

In [65]:
df.loc[1:4] # give me the row 1,2,3,4 including 4

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
2,2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN
3,2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,NaN
4,2576,Ching's Secret,Singapore Curry,Pack,India,3.75,NaN

In [67]:
df1=df.set_index("Review #")
df1.head()

,Brand,Variety,Style,Country,Stars,Top Ten
Review #,,,,,,
2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN
2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,NaN
2576,Ching's Secret,Singapore Curry,Pack,India,3.75,NaN

In [68]:
df1.iloc[0:3,:]

,Brand,Variety,Style,Country,Stars,Top Ten
Review #,,,,,,
2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN

In [69]:
df1.loc[0:3,:]

Empty DataFrame
Columns: [Brand, Variety, Style, Country, Stars, Top Ten]
Index: []

In [72]:
df1.loc[2580:2578,:]

,Brand,Variety,Style,Country,Stars,Top Ten
Review #,,,,,,
2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN